<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
      "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <title>ReadMe_1</title>
  <meta name="generator" content="Amaya, see http://www.w3.org/Amaya/">
</head>

<body>
<h1>TinyXML</h1>

<h2>Introdu&ccedil;&atilde;o</h2>

<p>O TinyXML &eacute; uma pequena biblioteca C++ multi-plataforma que
implementa um parser simples de XML, que permite, entre outras
funcionalidades:</p>
<ul>
  <li>a leitura de um documento XML para uma estrutura interna de dados
    constitu&iacute;da por n&oacute;s e elementos (Nodes e Elements) XML,</li>
  <li>o acesso aos dados de diversas formas: iterativamente ou atrav&eacute;s
    de acesso directo a determinados elementos</li>
  <li>a altera&ccedil;&atilde;o da estrutura, inserindo, modificando ou
    removendo elementos</li>
  <li>a grava&ccedil;&atilde;o para ficheiro em formato XML de uma estrutura em
    mem&oacute;ria</li>
</ul>

<p>Mais informa&ccedil;&otilde;es sobre o projecto, bem como as sources do
mesmo, podem ser encontradas nos endere&ccedil;os seguintes:</p>
<ul>
  <li>P&aacute;gina projecto:<br>
    <a
    href="http://www.grinninglizard.com/tinyxml/">http://www.grinninglizard.com/tinyxml/</a></li>
</ul>
<ul>
  <li>Documenta&ccedil;&atilde;o Online, com exemplos:<br>
    <a
    href="http://www.grinninglizard.com/tinyxmldocs/index.html">http://www.grinninglizard.com/tinyxmldocs/index.html</a></li>
</ul>
<ul>
  <li>P&aacute;gina do projecto Sourceforge (com sources):<br>
    <a
    href="http://www.sourceforge.net/projects/tinyxml">http://www.sourceforge.net/projects/tinyxml</a></li>
</ul>

<p></p>
<hr>

<h2>Instala&ccedil;&atilde;o</h2>

<p>Para utilizar o TinyXML em projectos simples em C++/win32, apenas s&atilde;o
necess&aacute;rios os seguintes ficheiros: os bin&aacute;rios da biblioteca
tinyxml.lib (vers&atilde;o release) ou tinyxmld.lib (vers&atilde;o debug) e
dois header files, tinyxml.h e tinystr.h.</p>

<p>Estes ficheiros podem ser colocados nas respectivas directorias "lib" e
"include" do sistema, tal como indicado para as bibliotecas de GLUT (ver
documenta&ccedil;&atilde;o de instala&ccedil;&atilde;o de GLUT) ou,
alternativamente, podem ser colocados na pr&oacute;pria pasta do projecto,
sendo necess&aacute;rio incluir a lib no pr&oacute;prio projecto.</p>

<p>Os ficheiros referidos podem ser obtidos de duas formas:</p>
<ul>
  <li>Utilizando a vers&atilde;o disponibilizada no FTP, baseada nas sources
    com a vers&atilde;o 2.5.3 e compiladas com VS 2008</li>
  <li>Compilando as pr&oacute;prias vers&otilde;es, utilizando as sources
    dispon&iacute;veis no endere&ccedil;o <a
    href="http://sourceforge.net/projects/tinyxml/">http://sourceforge.net/projects/tinyxml/</a>.
    O pacote inclui os headers referidos, e um projecto de Visual Studio que ao
    ser compilado gera os ficheiros ".lib" referidos (tinyxml.lib ou
    tinyxmld.lib, conforme o perfil de compila&ccedil;&atilde;o escolhido,
    release ou debug).<br>
  </li>
</ul>
<hr>

<h2>Utiliza&ccedil;&atilde;o do exemplo junto</h2>
<ul>
  <li>A bilbioteca (TinyXML.lib) encontra-se inclu&iacute;da no projecto e
    &eacute; referida no c&oacute;digo,</li>
  <li>Inclui-se o header tinyxml.h (#include "tinyxml.h")</li>
  <li>No main, invoca-se LoadScene()</li>
  <li>Em SceneLoader, l&ecirc;-se o XML e imprime-se o resultdo na consola.</li>
</ul>

<p>O XML encontra-se no direct&oacute;rio do projecto.</p>

<p>NOTA: este XML n&atilde;o tem qualquer semelhan&ccedil;a com o que
ser&aacute; necess&aacute;rio tratar no segundo trabalho.</p>
</body>
</html>
